IDENTIFICATION DIVISION.
PROGRAM-ID. AEROPROJ.
AUTHOR. MIMY.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT AVION ASSIGN TO "favion.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS CODAV
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES.
	SELECT PILOTE ASSIGN TO "fpilot.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS NUMPIL.
	SELECT VISITE ASSIGN TO "fvisit.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS NUMVISIT.
	SELECT AVION ASSIGN TO "favion.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS CODAV
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES.
	SELECT AVION ASSIGN TO "favion.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS CODAV
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES.
	SELECT AVION ASSIGN TO "favion.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS CODAV
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES.
	SELECT AVION ASSIGN TO "favion.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS CODAV
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES.
	
DATA DIVISION.

WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
PRINCIPAL SECTION.