IDENTIFICATION DIVISION.
PROGRAM-ID. AEROPROJ.
AUTHOR. MIMY.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT AVION ASSIGN TO "favion.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS CODAV
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES.
	SELECT PILOTE ASSIGN TO "fpilot.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS NUMPIL.
	SELECT VISITE ASSIGN TO "fvisit.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS NUMVISIT.
	SELECT TYPEFILE ASSIGN TO "ftyp.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS NUMTYP.
	SELECT TABLEFILE ASSIGN TO "ftabl.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS PILTYP
	ALTERNATE RECORD KEY IS CODTYP WITH DUPLICATES
	ALTERNATE RECORD KEY IS CODPIL WITH DUPLICATES.
	SELECT VOL ASSIGN TO "fvol.dat"
	ORGANIZATION IS INDEXED
	RECORD KEY IS NUMVOL
	ALTERNATE RECORD KEY IS NUMPIL WITH DUPLICATES
	ALTERNATE RECORD KEY IS NUMAV WITH DUPLICATES.
	
DATA DIVISION.

WORKING-STORAGE SECTION.
77 NUMVISIT PIC 9.
77 NUMPIL PIC 9.
77 CODAV PIC 9.
77 CODTYP PIC 9.
77 NUMTYP PIC 9.
77 NUMPIL PIC 9.
77 NUMAV PIC 9.
77 NUMVOL PIC 9.
01 PILTYP.
	02 CODPIL PIC 9.
	02 CODTYP PIC 9.

PROCEDURE DIVISION.
PRINCIPAL SECTION.


FIN.
	STOP RUN.
