IDENTIFICATION DIVISION.
PROGRAM-ID. F1.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 DEST PIC X(25).
77 TYPE-VOL PIC Z(3).
77 CHOIX PIC X.
77 ERREURS PIC X(50) VALUE IS " ".
01 CURRENT-WDATE.
   02 WJOUR PIC 99.
   02 FILLER PIC X VALUE "/".
   02 WMOIS PIC 99.
   02 FILLER PIC X VALUE "/".
   02 WANNEE PIC 99.
01 DATE-DEPART.
   02 DJOUR PIC ZZ.
   02 DMOIS PIC ZZ.
   02 DANNEE PIC ZZ.
   02 DHEURE PIC ZZ.
   02 DMINUTE PIC ZZ.

01 DATE-ARRIVEE.
   02 AJOUR PIC ZZ.
   02 AMOIS PIC ZZ.
   02 AANNEE PIC ZZ.
   02 AHEURE PIC ZZ.
   02 AMINUTE PIC ZZ.
    
    
LINKAGE SECTION.   
SCREEN SECTION.
  01  SCREEN-ACCUEIL.
      05 LINE 01 COL 01 VALUE "******************".
      05 LINE 02 COL 01 PIC X(8) FROM CURRENT-WDATE.
      05 LINE 03 COL 01 VALUE "Application de gestion aeroclub".
      05 LINE 04 COL 01 VALUE "DEPOT D'UN PLAN DE VOL".
      05 LINE 05 COL 01 VALUE "******************".
	  05 LINE 07 COL 01 VALUE "Veuillez entrez une date de départ au format JJMMAAHHmm" .
	  05 LINE 08 COL 01 PIC X(10) FROM DATE-DEPART.
	  05 LINE 07 COL 01 VALUE "Veuillez entrez une date d'arrivée au format JJMMAAHHmm" .
	  05 LINE 08 COL 01 PIC X(10) FROM DATE-ARRIVEE.
	  05 LINE 10 COL 01 VALUE "Destination du vol : ".
	  05 LINE 11 COL 01 PIC X(25) FROM DEST.
	  05 LINE 13 COL 01 VALUE "Type du vol : ".
	  05 LINE 14 COL 01 PIC X(25) FROM TYPE-VOL.
	  05 LINE 19 COL 01 VALUE "******************".   
      05 LINE 20 COL 01 PIC X(43) FROM ERREURS.
      05 LINE 21 COL 01 VALUE "ENTREZ UN CHOIX OU QUITTER (Q) :".
      05 LINE 22 COL 01 PIC X TO CHOIX.
	  
PROCEDURE DIVISION.

DEBUT.

PERFORM AFFICHE-ACCUEIL.


AFFICHE-ACCUEIL.
   ACCEPT CURRENT-WDATE FROM DATE
   DISPLAY SCREEN-ACCUEIL
   ACCEPT SCREEN-ACCUEIL.

   
FIN.
   STOP RUN.