IDENTIFICATION DIVISION.
PROGRAM-ID. F2.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 CPTRES PIC 9(6).
77 CHOIX PIC X.
77 ERREURS PIC X(50) VALUE IS " ".

01 WDATE.
   02 WANNEE PIC 99.
   02 WMOIS PIC 99.
   02 WJOUR PIC 99.
   
   
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE AVIONS
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-AVIONS.
			05 WS-CODAV PIC 9(3).
			05 WS-CODTYP PIC X(2).
			05 WS-CPTHORAV PIC 9(6).
			05 WS-CPTINTER PIC 9(3).
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE VOLS
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-VOLS.
			05 WS-NUMVOL PIC 9(6).
			05 WS-DATEDEB PIC X(10).
			05 WS-DATEFIN PIC X(10).
			05 WS-CPTDEP PIC 9(6).
			05 WS-CPTARR PIC 9(6).
			05 WS-DESTIN PIC X(25).
			05 WS-ETATVOL PIC X.
	EXEC SQL END DECLARE SECTION
	END-EXEC.

	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE PILOTES
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-PILOTES.
			05 WS-NUMPIL PIC 9(3).
			05 WS-NBHVOL PIC 9(6).
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
	
	
LINKAGE SECTION.
SCREEN SECTION.
  01  SCREEN-ACCUEIL.
      05 LINE 01 COL 01 VALUE "******************".
      05 LINE 02 COL 01 PIC 99 FROM WJOUR.
	  05 LINE 02 COL 03 VALUE "-".
	  05 LINE 02 COL 04 PIC 99 FROM WMOIS.
	  05 LINE 02 COL 06 VALUE "-".
	  05 LINE 02 COL 07 PIC 99 FROM WANNEE.
      05 LINE 03 COL 01 VALUE "Application de gestion Aeroclub".
      05 LINE 04 COL 01 VALUE "ENREGISTREMENT D'UN VOL".
      05 LINE 05 COL 01 VALUE "******************".
	  05 LINE 07 COL 01 VALUE "Veuillez entrez votre numéro de pilote : "
	  05 LINE 07 COL 42 PIC 9(3) TO WS-NUMPIL.
	  05 LINE 08 COL 01 VALUE "Veuillez entrez le numéro de vol : "
	  05 LINE 08 COL 36 PIC 9(3) TO WS-CODAV.
	  05 LINE 09 COL 01 VALUE "Veuillez entrez une date de départ au format JJMMAAHHmm : " .
	  05 LINE 09 COL 59 PIC X(10) TO WS-DATEDEB.
	  05 LINE 10 COL 01 VALUE "Veuillez entrez une date d'arrivée au format JJMMAAHHmm : " .
	  05 LINE 10 COL 59 PIC X(10) TO WS-DATEFIN.
	  05 LINE 11 COL 01 VALUE "Destination du vol : ".
	  05 LINE 11 COL 22 PIC X(25) TO WS-DESTIN.
	  05 LINE 12 COL 01 VALUE "Compteur horaire au départ du vol : ".
	  05 LINE 12 COL 37 PIC 9(6) TO WS-CPTDEP.
	  05 LINE 13 COL 01 VALUE "Compteur arrivée au départ du vol : ".
	  05 LINE 13 COL 37 PIC 9(6) TO WS-CPTARR.
	  05 LINE 19 COL 01 VALUE "******************".   
      05 LINE 20 COL 01 PIC X(43) FROM ERREURS.
      05 LINE 21 COL 01 VALUE "ENTREZ UN CHOIX OU QUITTER (Q) :".
      05 LINE 22 COL 01 PIC X TO CHOIX.
  
	  
PROCEDURE DIVISION.

DEBUT.
	PERFORM AFFICHE-ACCUEIL THRU ENREGISTREMENT.
	STOP RUN.
	
AFFICHE-ACCUEIL.
	ACCEPT WDATE FROM DATE.
    DISPLAY SCREEN-ACCUEIL.
    ACCEPT SCREEN-ACCUEIL.
   
AFFICHAGE-SAISIE.
    ACCEPT WS-NUMPIL LINE 07 COL 42.
	ACCEPT WS-CODAV LINE 08 COL 36.
	ACCEPT WS-DATEDEB LINE 09 COL 59.
	ACCEPT WS-DATEFIN LINE 10 COL 59.
	ACCEPT WS-DESTIN LINE 11 COL 22.
	ACCEPT WS-CPTDEP LINE 12 COL 37.
	ACCEPT WS-CPTARR LINE 13 COL 37.

ENREGISTREMENT.
	SUBTRACT WS-CPTDEP FROM WS-CPTARR GIVING CPTRES.
	
	EXEC SQL
		SELECT CPTINTER, CPTHORAV
		INTO :WS-CPTINTER, WS-CPTHORAV FROM AVIONS
		WHERE CODAV=WS-CODAV
	END-EXEC.
	
	ADD CPTRES TO WS-CPTINTER.
	MOVE CPTRES TO WS-CPTHORAV.
	EXEC SQL
		UPDATE AVIONS SET CPTINTER=:WS-CPTINTER, CPTHORAV=:WS-CPTHORAV
		WHERE CODAV=WS-CODAV
	END-EXEC.
  
	IF SQLCODE=0
	DISPLAY "RECORD UPDATED SUCCESSFULLY"
	DISPLAY WS-AVIONS
	ELSE DISPLAY "ERROR"
	END-IF.
	
	EXEC SQL
		SELECT NBHVOL
		INTO :WS-NBHVOL FROM PILOTES
		WHERE NUMPIL=WS-NUMPIL
	END-EXEC.
	
	ADD CPTRES TO WS-NBHVOL.
	EXEC SQL
		UPDATE PILOTES SET NBHVOL=:WS-NBHVOL
		WHERE NUMPIL=WS-NUMPIL
	END-EXEC.
  
	IF SQLCODE=0
	DISPLAY "RECORD UPDATED SUCCESSFULLY"
	DISPLAY WS-PILOTES
	ELSE DISPLAY "ERROR"
	END-IF.
	
	EXEC SQL
		SELECT LAST NUMVOL
		INTO :WS-NUMVOL FROM VOLS
	END-EXEC.
	
	ADD 1 TO WS-NUMVOL
	MOVE "T" TO WS-ETATVOL
	EXEC SQL
		INSERT INTO VOLS(NUMVOL,DATEDEB,DATEFIN,CPTDEP,CPTARR,DESTIN,ETATVOL)
		VALUES(:WS-NUMVOL,:WS-DATEDEB,WS-DATEFIN,WS-CPTDEP,WS-CPTARR,WS-DESTIN,WS-ETATVOL)
		WHERE NUMVOL=:WS-NUMVOL
	END-EXEC.
  
	IF SQLCODE=0
	DISPLAY "RECORD INSERTED SUCCESSFULLY"
	DISPLAY WS-VOLS
	ELSE DISPLAY "ERROR"
	END-IF.
	
FIN.