IDENTIFICATION DIVISION.
PROGRAM-ID. F3.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 VALIDATION PIC X(42) VALUE IS " ".
77 NUMPILBIS PIC X(3) VALUE IS " ".
77 CHOIX PIC X.
77 CHOIXACTION PIC X.
77 I PIC 9 VALUE IS 0.
77 ERREURS PIC X(50) VALUE IS " ".

01 WDATE.
   02 WANNEE PIC 99.
   02 WMOIS PIC 99.
   02 WJOUR PIC 99.
    
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE PILOTES
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-PILOTES.
			05 WS-NUMPIL PIC 9(3).
			05 WS-NOM PIC X(20).
			05 WS-PRENOM PIC X(20).
			05 WS-NBHVOL PIC 9(6).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
****************************************	
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE CIVILITE
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-CIVILITE.
			05 WS-CIVID PIC 9(3).
			05 WS-LIBELLE PIC X(20).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
****************************************	
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE ADRESSE
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-ADRESSE.
			05 WS-ADRESSEID PIC 9(3).
			05 WS-NUMERO PIC 9(3).
			05 WS-TYPEVOIE PIC X(20).
			05 WS-NOMVOIE PIC X(50).
			05 WS-NUMERO PIC 9(5).
			05 WS-VILLE PIC X(20).
			05 WS-PAYS PIC X(20).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
****************************************	
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE ETAT_PILOTE_PRESENCE
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-ETAT_PILOTE_PRESENCE.
			05 WS-NUMPRESENCE PIC X(1).
			05 WS-NOMPRESENCE PIC X(10).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
****************************************
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE ETAT_PILOTE_SANTE
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-ETAT_PILOTE_SANTE.
			05 WS-NUMSANTE PIC X(1).
			05 WS-NOMSANTE PIC X(10).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
****************************************	
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE ETAT_PILOTE_SITUATION
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-ETAT_PILOTE_SITUATION.
			05 WS-NUMSITUATION PIC X(1).
			05 WS-NOMSITUATION PIC X(10).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
****************************************	
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE TYPES
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-TYPES.
			05 WS-NUMTYP PIC 9(3).
			05 WS-DESIGN PIC X(20).
			
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
LINKAGE SECTION.
SCREEN SECTION.
  01 DELETE-SCREEN BLANK SCREEN.
  01  SCREEN-ACCUEIL.
      05 LINE 01 COL 01 VALUE "******************".
      05 LINE 02 COL 01 PIC 99 FROM WJOUR.
	  05 LINE 02 COL 03 VALUE "-".
	  05 LINE 02 COL 04 PIC 99 FROM WMOIS.
	  05 LINE 02 COL 06 VALUE "-".
	  05 LINE 02 COL 07 PIC 99 FROM WANNEE.
      05 LINE 03 COL 01 VALUE "Application de gestion Aeroclub".
      05 LINE 04 COL 01 VALUE "MISE A JOUR DES PILOTES".
      05 LINE 05 COL 01 VALUE "******************".
	  05 LINE 07 COL 01 VALUE "1 : Créer un profil de pilote".
	  05 LINE 08 COL 01 VALUE "2 : Mettre à jour les informations du profil".
	  05 LINE 09 COL 01 VALUE "3 : Supprimer un profil".
	  05 LINE 10 COL 01 VALUE "Taper le chiffre correspondant à votre choix : ".
	  05 line 10 COL 48 PIC X TO CHOIXACTION.
	  05 LINE 20 COL 01 PIC X(43) FROM ERREURS.
      05 LINE 21 COL 01 VALUE "REVENIR AU MENU (M) OU QUITTER (Q) :".
      05 LINE 22 COL 01 PIC X TO CHOIX.
	
  01  SCREEN-CREATION.
	  05 LINE 01 COL 01 VALUE "******************".
	  05 LINE 02 COL 01 PIC 99 FROM WJOUR.
	  05 LINE 02 COL 03 VALUE "/".
	  05 LINE 02 COL 04 PIC 99 FROM WMOIS.
	  05 LINE 02 COL 06 VALUE "/".
	  05 LINE 02 COL 07 PIC 99 FROM WANNEE.
	  05 LINE 03 COL 01 VALUE "Civilité : ".
	  05 LINE 03 COL 12 PIC 9(3) TO WS-CIVID.
	  05 LINE 04 COL 01 VALUE "Nom : ".
	  05 LINE 04 COL 07 PIC X(20) TO WS-NOM.
	  05 LINE 05 COL 01 VALUE "Prénom : ".
	  05 LINE 05 COL 10 PIC X(20) TO WS-PRENOM.
	  05 LINE 06 COL 01 VALUE "Numéro de voie : ".
	  05 LINE 06 COL 18 PIC 9(3) TO WS-NUMERO.
	  05 LINE 07 COL 01 VALUE "Type de voie : ".
	  05 LINE 07 COL 16 PIC 9(3) TO WS-TYPEVOIE.
	  05 LINE 08 COL 01 VALUE "Nom de voie : ".
	  05 LINE 08 COL 15 PIC 9(3) TO WS-NOMVOIE.
	  05 LINE 09 COL 01 VALUE "Code postal : ".
	  05 LINE 09 COL 15 PIC 9(3) TO WS-CODEPOSTAL.
	  05 LINE 10 COL 01 VALUE "Ville : ".
	  05 LINE 10 COL 09 PIC 9(3) TO WS-VILLE.
	  05 LINE 11 COL 01 VALUE "Pays : ".
	  05 LINE 11 COL 08 PIC 9(3) TO WS-PAYS.
	  05 LINE 12 COL 01 VALUE "Type d'avion possible de piloter : "
	  05 LINE 12 COL 36 PIC 9(3) TO WS-NUMTYP.
	  05 LINE 13 COL 01 VALUE "Nombres d'heures de vol : ".
	  05 LINE 13 COL 27 PIC 9(6) TO WS-NBHVOL.
	  05 LINE 14 COL 01 VALUE "Voulez-vous valider les informations saisies ? O/N ".
	  05 LINE 14 COL 52 PIC X TO CHOIX.
  
  01  SCREEN-VALIDATION.
      05 LINE 15 COL 01 PIC X(42) FROM VALIDATION.
	  05 LINE 15 COL 43 PIC X(3) FROM WS-NUMPILBIS.
	  
PROCEDURE DIVISION.

DEBUT.
	DISPLAY DELETE-SCREEN.
	ACCEPT WDATE FROM DATE.
    DISPLAY SCREEN-ACCUEIL.
    ACCEPT SCREEN-ACCUEIL.
	
MENU.
EVALUATE CHOIXACTION
    WHEN "1"
        PERFORM CREATION
    WHEN "2"
        PERFORM MAJ
    WHEN "3"
        PERFORM SUPPRESSION
	WHEN OTHER
	   MOVE "Erreur dans votre choix." TO ERREURS.
	   GO TO DEBUT.
END-EVALUATE.

EVALUATE-CHOIX.
	IF CHOIX="m" OR CHOIX="M"
		CALL "PAGE-ACCUEIL"
	ELSE IF CHOIX="Q" OR CHOIX="q"
		STOP RUN
	ELSE
		PERFORM ERREURS-CHOIX.
	END-IF. 
	
CREATION.
	DISPLAY DELETE-SCREEN.
	ACCEPT WDATE FROM DATE.
    DISPLAY SCREEN-CREATION.
    ACCEPT SCREEN-CREATION.
	ACCEPT WS-CIVID LINE 03 COL 12.
	ACCEPT WS-NOM LINE 4 COL 7.
	ACCEPT WS-PRENOM LINE 5 COL 10.
	ACCEPT WS-NUMERO LINE 6 COL 18.
	ACCEPT WS-TYPEVOIE LINE 7 COL 16.
	ACCEPT WS-NOMVOIE LINE 8 COL 15.
	ACCEPT WS-CODEPOSTAL LINE 9 COL 15.
	ACCEPT WS-VILLE LINE 10 COL 9.
	ACCEPT WS-PAYS LINE 11 COL 8.
	ACCEPT WS-NUMTYP LINE 12 COL 36.
	ACCEPT WS-NBHVOL LINE 13 COL 27.
	ACCEPT VALIDATION LINE 14 COL 52.
	
	IF CHOIX = 'O' OR CHOIX = 'o' THEN 
	MOVE "Profil créé. Votre numéro de pilote est : " TO VALIDATION.
	EXEC SQL
		SELECT LAST(NUMPIL)
		INTO :WS-NUMPIL FROM PILOTES
	END-EXEC.
	ADD 1 TO WS-NUMPIL.
	MOVE WS-NUMPIL TO WS-NUMPILBIS.
	DISPLAY DELETE-SCREEN.
	DISPLAY SCREEN-VALIDATION.
	
	ELSE
		STOP RUN
	END-IF.	

MAJ.


SUPPRESSION.


ERREURS-CHOIX.
	ADD 1 TO I.
        IF I=3
			GO TO FIN
        ELSE 
            SUBTRACT I FROM 3 GIVING NB-ESSAI.
            MOVE "ERREUR, NOMBRE DE TENTATIVES RESTANTES : " TO ERREURS
            PERFORM DEBUT.

FIN.