IDENTIFICATION DIVISION.
PROGRAM-ID. F4.
DATA DIVISION.
WORKING-STORAGE SECTION.

77 CHOIX PIC X.
77 CHOIX-MAJ PIC X.
77 I PIC 9 VALUE IS 0.
77 ERREURS PIC X(50) VALUE IS " ".
77 NUM-AV-SAISI PIC ZZ.
77 CPT-SAISI PIC ZZZ.
77 INFO-TECH PIC X(50).
77 COUNT-AV-CONTROLE PIC 9.
01  WDATE.
   02  WANNEE PIC 99.
   02  WMOIS PIC 99.
   02  WJOUR PIC 99.
01  WDATEMOIN.
   02  WJOURMOIN PIC 99.
   02  FILLER PIC X VALUE "/".
   02  WMOISMOIN PIC 99.
   02  FILLER PIC X VALUE "/".
   02  WANNEEMOIN PIC 99.

	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE AVIONS
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-AVIONS.
			05 WS-CODAV PIC 9(2).
			05 WS-CODTYP PIC X(2).
			05 WS-CPTHORAV PIC 9(3).
			05 WS-CPTINTER PIC 9(3).
			05 WS-INFOS PIC X(50).
			05 WS-ETATAV PIC X.
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
	EXEC SQL
		INCLUDE ETAT_AVION
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
	TABLE ETAT_AVION
		01 WS-ETAT-AVION.
			05 WS-NUMETATAV PIC X.
			05 WS-NOMETATAV PIC X(10).
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
	EXEC SQL
		INCLUDE CONTROLES
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-CONTROLES.
			05 WS-NUMCONTROL PIC 9(3).
			05 WS-NUMAVIONPIC 9(3).
			05 WS-DATECONTROL PIC X(10).
			05 WS-RESCONTROL PIC 9.
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
	EXEC SQL
		INCLUDE TYPES
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-TYPES.
			05 WS-NUMTYP PIC X(2).
			05 WS-DESIGN PIC X
	EXEC SQL END DECLARE SECTION
	END-EXEC.
	
	


LINKAGE SECTION.
SCREEN SECTION.
  01  SCREEN-F4.
		05 LINE 01 COL 01 VALUE "******************".
		05 LINE 02 COL 01 PIC 99 FROM WJOUR.
		05 LINE 02 COL 03 VALUE "/".
		05 LINE 02 COL 04 PIC 99 FROM WMOIS.
		05 LINE 02 COL 06 VALUE "/".
		05 LINE 02 COL 07 PIC 99 FROM WANNEE.
		05 LINE 03 COL 01 VALUE "Application de gestion Aeroclub".
		05 LINE 04 COL 01 VALUE "Mise à jour avions".
		05 LINE 05 COL 01 VALUE "******************".
		05 LINE 06 COL 01 VALUE "Entrez le numéro d'avion à mettre à jour :"
		05 LINE 07 COL 01 PIC Z(2) TO NUM-AV-SAISI.
		05 LINE 09 COL 01 VALUE "1 : Ajouter un avion".
		05 LINE 10 COL 01 VALUE "2 : Modifier les informations d'un avion".
		05 LINE 11 COL 01 VALUE "3 : Supprimer un avion".
		05 LINE 13 COL 01 VALUE "Choisir la mise à jour à effectuer : ".
		05 LINE 14 COL 01 PIC X TO CHOIX-MAJ.
		05 LINE 19 COL 01 VALUE "******************".   
		05 LINE 20 COL 01 PIC X(43) FROM ERREURS.
		05 LINE 21 COL 01 VALUE "REVENIR AU MENU(M) OU QUITTER (Q) :".
		05 LINE 22 COL 01 PIC X TO CHOIX.
   01 SCREEN-AJOUT-AVION.
		05 LINE 01 COL 01 VALUE "******************".
		05 LINE 02 COL 01 PIC 99 FROM WJOUR.
		05 LINE 02 COL 03 VALUE "/".
		05 LINE 02 COL 04 PIC 99 FROM WMOIS.
		05 LINE 02 COL 06 VALUE "/".
		05 LINE 02 COL 07 PIC 99 FROM WANNEE.
		05 LINE 06 COL 01 VALUE "******************".
		05 LINE 07 COL 01 VALUE "AJOUT D'UN NOUVEL AVION".
		05 LINE 08 COL 01 VALUE "******************".
		05 LINE 13 COL 01 "Saisir le compteur horaire du nouvel avion : ".
		05 LINE 14 COL 01 PIC Z(3) TO CPT-SAISI.
		05 LINE 19 COL 01 VALUE "******************".   
		05 LINE 20 COL 01 PIC X(43) FROM ERREURS.
		05 LINE 21 COL 01 VALUE "REVENIR AU MENU(M) OU QUITTER (Q) :".
		05 LINE 22 COL 01 PIC X TO CHOIX.
		
   01 SCREEN-MAJ-AVION
		05 LINE 01 COL 01 VALUE "******************".
		05 LINE 02 COL 01 PIC 99 FROM WJOUR.
		05 LINE 02 COL 03 VALUE "/".
		05 LINE 02 COL 04 PIC 99 FROM WMOIS.
		05 LINE 02 COL 06 VALUE "/".
		05 LINE 02 COL 07 PIC 99 FROM WANNEE.
		05 LINE 06 COL 01 VALUE "******************".
		05 LINE 07 COL 01 VALUE "MODIFICATION D'UN AVION".
		05 LINE 08 COL 01 VALUE "******************".
		05 LINE 16 COL 01 "Saisir les informations techniques à modifier: ".
		05 LINE 17 COL 01 PIC X(50) TO INFO-TECH.
		05 LINE 19 COL 01 VALUE "******************".   
		05 LINE 20 COL 01 PIC X(43) FROM ERREURS.
		05 LINE 21 COL 01 VALUE "REVENIR AU MENU(M) OU QUITTER (Q) :".
		05 LINE 22 COL 01 PIC X TO CHOIX.
   
PROCEDURE DIVISION.
DEBUT.

PERFORM AFFICHE-ACCUEIL THRU EVALUATE-CHOIX.

AFFICHE-ACCUEIL.
	DISPLAY DELETE-SCREEN.
	ACCEPT WDATE FROM DATE.
    DISPLAY SCREEN-F4.
    ACCEPT SCREEN-F4.
   
AFFICHAGE-SAISIE.
	ACCEPT NUM-AV-SAISI LINE 07 COL 01.
	ACCEPT CHOIX-MAJ LINE 14 COL 01.
	ACCEPT CHOIX LINE 22 COL 01.
	
EVALUATE-CHOIX-MAJ.
	EVALUATE CHOIX-MAJ
		WHEN "1"
			PERFORM AJOUT-AVION
		WHEN "2"
			PERFORM MAJ-AVION
		WHEN "3"
			PERFORM SUPP-AVION
		WHEN OTHER 
			MOVE "Erreur dans votre choix." TO ERREURS.
			
EVALUATE-CHOIX.
	IF CHOIX="m" OR CHOIX="M"
		CALL "PAGE-ACCUEIL"
	ELSE IF CHOIX="Q" OR CHOIX="q"
		STOP RUN
	ELSE
		PERFORM ERREURS-CHOIX.
	END-IF.
	
			
AJOUT-AVION.
*****screen ajout avion
	DISPLAY DELETE-SCREEN
	ACCEPT WDATE FROM DATE
	DISPLAY SCREEN-AJOUT-AVION
	ACCEPT CPT-SAISI LINE 14 COL 01
*******AJOUT
	
	EXEC SQL 
		SELECT COUNT (NUMCONTROL) FROM CONTROLES
		INTO :WS-NUMCONTROL
		WHERE RESCONTROL=1
	END-EXEC.
	
	IF NOT COUNT-AV-CONTROLE=0
		EXEC SQL
			INSERT AVIONS (CODAV, CPTINTER, CPTHORAV, ETATAV)
			VALUES(:CODAV, :0, CPT-SAISI, "E")
		END-EXEC
	ELSE
		DISPLAY "L'avion ne peut être ajouté, il n'a pas passé de contrôle technique satisfaisant."
	END-IF.

MAJ-AVION.
	DISPLAY DELETE-SCREEN
	ACCEPT WDATE FROM DATE
	DISPLAY SCREEN-MAJ-AVION
	ACCEPT INFO-TECH LINE 17 COL 01
	
	EXEC SQL
		UPDATE AVIONS SET INFOS:=INFO-TECH
		WHERE CODAV=AV-SAISI	
	END-EXEC.

	IF SQLCODE=0
		DISPLAY "Les informations techniques de l'avion " AV-SAISI " ont bien été prises en compte."
	ELSE
			DISPLAY "Erreur lors de la modification des informations sur l'avion."
	END-IF.
	

SUPP-AVION.
	EXEC SQL
		UPDATE AVIONS SET ETATAV:="R"
		WHERE CODAV=AV-SAISI
	END-EXEC.
	
	IF SQLCODE=0
		DISPLAY "L'avion " AV-SAISI " a bien été supprimé."
		ELSE
			DISPLAY "Erreur lors de la suppression de l'avion."
	END-IF.


ERREURS-CHOIX.
	ADD 1 TO I.
        IF I=3
			GO TO FIN
        ELSE 
            SUBTRACT I FROM 3 GIVING NB-ESSAI.
            MOVE "ERREUR, NOMBRE DE TENTATIVES RESTANTES : " TO ERREURS
            PERFORM DEBUT.

FIN.
	STOP RUN.