IDENTIFICATION DIVISION.
PROGRAM-ID. F6.
DATA DIVISION.
WORKING-STORAGE SECTION.
	77 PERIOD1 PIC Z(6).
	77 PERIOD2 PIC Z(6).
	77 M PIC 99 VALUE IS 11.
	77 N PIC 999 VALUE IS 0.
	77 SUIVANT PIC X.
	77 COUNTPIL PIC 999.

	77 CHOIX PIC X.
	77 ERREURS PIC X(50) VALUE IS " ".
	77 NB-ESSAI PIC Z VALUE IS 0.
	77 I PIC 9 VALUE IS 0.

	01 WDATE.
	   02 WANNEE PIC 99.
	   02 WMOIS PIC 99.
	   02 WJOUR PIC 99.
	   
	EXEC SQL
		INCLUDE SQLCA
	END-EXEC.
	
	EXEC SQL
		INCLUDE VOLS,PILOTES
	END-EXEC.
	
	EXEC SQL BEGIN DECLARE SECTION
	END-EXEC.
		01 WS-PILVOLS. 
			05 WS-NUMVOL PIC 9(6).
			05 WS-DATEDEB PIC X(10).
			05 WS-DATEFIN PIC X(10).
			05 WS-CPTDEP PIC 9(6).
			05 WS-CPTARR PIC 9(6).
			05 WS-DESTIN PIC X(25).
			05 WS-ETATVOL PIC X.
			05 WS-NUMAV PIC Z(3).
			05 WS-NUMPIL PIC 9(3).
			05 WS-TEMPSVOL PIC 9(6).
			05 WS-NBHVOL PIC Z(6).
			05 WS-NOM PIC X(20).
			05 WS-PRENOM PIC X(20).
			05 WS-TOTALHVOL PIC Z(9).
	EXEC SQL END DECLARE SECTION
	END-EXEC.

LINKAGE SECTION.
SCREEN SECTION.
  01 DELETE-SCREEN BLANK SCREEN.
  01  SCREEN-ACCUEIL.
      05 LINE 01 COL 01 VALUE "******************".
      05 LINE 02 COL 01 PIC 99 FROM WJOUR.
	  05 LINE 02 COL 03 VALUE "-".
	  05 LINE 02 COL 04 PIC 99 FROM WMOIS.
	  05 LINE 02 COL 06 VALUE "-".
	  05 LINE 02 COL 07 PIC 99 FROM WANNEE.
      05 LINE 03 COL 20 VALUE "RECAPITULATIF PILOTES".
      05 LINE 04 COL 15 VALUE "Periode du ".
	  05 LINE 04 COL 26 PIC Z(6) TO PERIOD1.
	  05 LINE 04 COL 33 VALUE "au ".
	  05 LINE 04 COL 36 PIC Z(6) TO PERIOD2.
	  05 LINE 05 COL 10 VALUE "N. pilote ".
	  05 LINE 05 COL 38 VALUE "Nb heures de vol".
	  05 LINE 06 COL 10 VALUE "Nom".
	  05 LINE 06 COL 35 VALUE "Prenom".
	  05 LINE 08 COL 13 VALUE "|".
	  05 LINE 09 COL 05 VALUE "N. avion  |".
	  05 LINE 08 COL 32 VALUE "Vols effectues".
	  05 LINE 08 COL 63 VALUE "|".
	  05 LINE 09 COL 13 
	  VALUE "|-------------------------------------------------|".
	  05 LINE 10 COL 13 VALUE "|     N. vol ".
	  05 LINE 10 COL 30 VALUE "|  Date départ ".
	  05 LINE 10 COL 47 VALUE "|   Temps vol ".
	  05 LINE 10 COL 64 VALUE "|".
	  05 LINE 19 COL 01 VALUE "******************".
	  05 LINE 20 COL 01 PIC X(50) FROM ERREURS.
	  05 LINE 20 COL 42 PIC Z FROM NB-ESSAI.
      05 LINE 21 COL 01 VALUE "REVENIR AU MENU (M) OU QUITTER (Q) :".
      05 LINE 22 COL 01 PIC X TO CHOIX.
	  
  01  SCREEN-LISTE.
      05 LINE 01 COL 01 VALUE "******************".
      05 LINE 02 COL 01 PIC 99 FROM WJOUR.
	  05 LINE 02 COL 05 VALUE "-".
	  05 LINE 02 COL 04 PIC 99 FROM WMOIS.
	  05 LINE 02 COL 06 VALUE "-".
	  05 LINE 02 COL 07 PIC 99 FROM WANNEE.
      05 LINE 03 COL 20 VALUE "RECAPITULATIF PILOTES".
      05 LINE 04 COL 15 VALUE "Periode du ".
	  05 LINE 04 COL 26 PIC Z(6) FROM PERIOD1.
	  05 LINE 04 COL 33 VALUE "au ".
	  05 LINE 04 COL 36 PIC Z(6) FROM PERIOD2.
	  05 LINE 05 COL 10 VALUE "N. pilote ".
	  05 LINE 05 COL 20 PIC Z(3) FROM WS-NUMPIL.
	  05 LINE 05 COL 38 VALUE "Nb heures de vol".
	  05 LINE 05 COL 55 PIC Z(6) FROM WS-NBHVOL.
	  05 LINE 06 COL 10 VALUE "Nom".
	  05 LINE 06 COL 14 PIC X(20) FROM WS-NOM.
	  05 LINE 06 COL 35 VALUE "Prenom".
	  05 LINE 06 COL 42 PIC X(20) FROM WS-PRENOM.
	  05 LINE 08 COL 13 VALUE "|".
	  05 LINE 09 COL 05 VALUE "N. avion  |".
	  05 LINE 08 COL 32 VALUE "Vols effectues".
	  05 LINE 08 COL 63 VALUE "|".
	  05 LINE 09 COL 13 
	  VALUE "|-------------------------------------------------|".
	  05 LINE 10 COL 13 VALUE "|     N. vol ".
	  05 LINE 10 COL 30 VALUE "|  Date départ ".
	  05 LINE 10 COL 47 VALUE "|   Temps vol ".
	  05 LINE 10 COL 64 VALUE "|".
	  05 LINE 11 COL 07 PIC Z(3) FROM WS-NUMAV.
	  05 LINE 17 COL 35 VALUE "Total heures vol ".
	  05 LINE 17 COL 52 PIC Z(9) FROM WS-TOTALHVOL.
	  05 LINE 18 COL 36 VALUE "Suivant (O/N) : ".
	  05 LINE 18 COL 52 PIC X TO SUIVANT.
	  05 LINE 19 COL 01 VALUE "******************".
	  05 LINE 20 COL 01 PIC X(50) FROM ERREURS.
	  05 LINE 20 COL 42 PIC Z FROM NB-ESSAI.
      05 LINE 21 COL 01 VALUE "REVENIR AU MENU (M) OU QUITTER (Q) :".
      05 LINE 22 COL 01 PIC X TO CHOIX.
	  
  01  SCREEN-MODIF.
	  05 LINE M COL 17 PIC 9(6) FROM WS-NUMVOL.
	  05 LINE M COL 34 PIC X(10) FROM WS-DATEDEB.
	  05 LINE M COL 52 PIC 9(6) FROM WS-TEMPSVOL.
	
  01  SCREEN-ABSENT.
	  05 LINE 01 COL 01 VALUE "******************".
      05 LINE 02 COL 01 PIC 99 FROM WJOUR.
	  05 LINE 02 COL 03 VALUE "-".
	  05 LINE 02 COL 04 PIC 99 FROM WMOIS.
	  05 LINE 02 COL 06 VALUE "-".
	  05 LINE 02 COL 07 PIC 99 FROM WANNEE.
      05 LINE 03 COL 20 VALUE "RECAPITULATIF PILOTES".
      05 LINE 04 COL 15 VALUE "Periode du ".
	  05 LINE 04 COL 26 PIC Z(6) FROM PERIOD1.
	  05 LINE 04 COL 33 VALUE "au ".
	  05 LINE 04 COL 36 PIC Z(6) FROM PERIOD2.
	  05 LINE 05 COL 10 VALUE "N. pilote ".
	  05 LINE 05 COL 20 PIC Z(3) FROM WS-NUMPIL.
	  05 LINE 05 COL 38 VALUE "Nb heures de vol".
	  05 LINE 05 COL 55 PIC Z(6) FROM WS-NBHVOL.
	  05 LINE 06 COL 10 VALUE "Nom".
	  05 LINE 06 COL 14 PIC X(20) FROM WS-NOM.
	  05 LINE 06 COL 35 VALUE "Prenom".
	  05 LINE 06 COL 42 PIC X(20) FROM WS-PRENOM.
	  05 LINE 12 COL 17 VALUE "AUCUN VOL DURANT LA PERIODE".
	  05 LINE 18 COL 36 VALUE "Suivant (O/N) : ".
	  05 LINE 18 COL 52 PIC X TO SUIVANT.
	  05 LINE 19 COL 01 VALUE "******************".
	  05 LINE 20 COL 01 PIC X(50) FROM ERREURS.
	  05 LINE 20 COL 42 PIC Z FROM NB-ESSAI.
      05 LINE 21 COL 01 VALUE "REVENIR AU MENU (M) OU QUITTER (Q) :".
      05 LINE 22 COL 01 PIC X TO CHOIX.
	
	  
PROCEDURE DIVISION.

DEBUT.

AFFICHAGE.
	DISPLAY DELETE-SCREEN.
	ACCEPT WDATE FROM DATE.
    DISPLAY SCREEN-ACCUEIL.
	ACCEPT PERIOD1 LINE 04 COL 26.
	ACCEPT PERIOD2 LINE 04 COL 36.
	
LISTE-AVIONS.
	DISPLAY DELETE-SCREEN.
	ACCEPT WDATE FROM DATE.
    DISPLAY SCREEN-LISTE.
    ACCEPT SCREEN-LISTE.
	
	EXEC SQL 
		SELECT COUNT(PILOTES) INTO COUNTPIL FROM PILOTES,VOLS 
		WHERE PILOTES.NUMPIL = VOLS.NUMPIL
		AND   DATEDEB>:PERIOD2 OR DATEDEB<:PERIOD1
	END-EXEC.
	
	EXEC SQL
		DECLARE PILABSCUR CURSOR FOR
		SELECT PILOTES.NUMPIL,NOM,PRENOM,NBHVOL FROM PILOTES,VOLS 
		WHERE PILOTES.NUMPIL = VOLS.NUMPIL
		AND   DATEDEB>:PERIOD2 OR DATEDEB<:PERIOD1
	END-EXEC.
	
	EXEC SQL
		OPEN PILABSCUR
	END-EXEC.
	
	EXEC SQL
		CLOSE PILABSCUR
	END-EXEC.
  
    PERFORM UNTIL SQLCODE=100 
		PERFORM UNTIL N > COUNTPIL
		
		EXEC SQL
			FETCH PILABSCUR
			INTO :WS-NUMPIL,:WS-NOM,WS-PRENOM,WS-NBHVOL
		END-EXEC
		DISPLAY DELETE-SCREEN	
		DISPLAY SCREEN-ABSENT
		ADD 1 TO N
		ACCEPT SUIVANT LINE 18 COL 52 
		IF SUIVANT = "O" OR SUIVANT = "o"
			DISPLAY DELETE-SCREEN	
			DISPLAY SCREEN-ABSENT
		END-IF
		END-PERFORM
		
	END-PERFORM.
************************************************************************	
	EXEC SQL
		DECLARE PILCUR CURSOR FOR
		SELECT PILOTES.NUMPIL,NOM,PRENOM,NBHVOL,NUMVOL,DATEDEB,CPTDEP,
		CPTARR,NUMAV FROM PILOTES,VOLS 
		WHERE PILOTES.NUMPIL = VOLS.NUMPIL
		AND   DATEDEB>=:PERIOD1 AND DATEDEB<=:PERIOD2
		ORDER BY NUMAV ASC, NUMVOL ASC
	END-EXEC.
	
	EXEC SQL
		OPEN PILCUR
	END-EXEC.
	
	EXEC SQL
		CLOSE PILCUR
	END-EXEC.
  
    PERFORM UNTIL SQLCODE=100 
		
		PERFORM UNTIL M=17
		
		EXEC SQL
			FETCH PILCUR
			INTO :WS-NUMPIL,:WS-NOM,WS-PRENOM,WS-NBHVOL,:WS-NUMVOL,
			:WS-DATEDEB,WS-CPTDEP,WS-CPTARR,WS-NUMAV
		END-EXEC
		
		SUBTRACT WS-CPTARR FROM WS-CPTDEP GIVING WS-TEMPSVOL
		ADD WS-TEMPSVOL GIVING WS-TOTALHVOL
		ADD 1 TO M
		
		DISPLAY SCREEN-LISTE
		DISPLAY SCREEN-MODIF
	
		END-PERFORM
		
		ACCEPT SUIVANT LINE 18 COL 52 
		IF SUIVANT = "O" OR SUIVANT = "o"
			MOVE 11 TO M
			DISPLAY DELETE-SCREEN
			DISPLAY SCREEN-LISTE
			DISPLAY SCREEN-MODIF
		END-IF
	
	END-PERFORM.
	
EVALUATE-CHOIX.
	ACCEPT CHOIX LINE 22 COL 01.
	IF CHOIX="m" OR CHOIX="M"
		CALL "PAGE-ACCUEIL"
	ELSE IF CHOIX="Q" OR CHOIX="q"
		STOP RUN
	ELSE
		PERFORM ERREURS-CHOIX
	END-IF.

ERREURS-CHOIX.
	ADD 1 TO I.
        IF I=3
			GO TO FIN
        ELSE 
            SUBTRACT I FROM 3 GIVING NB-ESSAI
            MOVE "ERREUR, NOMBRE DE TENTATIVES RESTANTES : " TO ERREURS
            PERFORM DEBUT.
	
FIN.
	STOP RUN.
	
	
	